---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEndtreatment
source: html/fcfeac53-570a-3238-9e50-41e7e1278f36.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEndtreatment Property

"End Treatment 2"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerCoupledEndtreatment { get; }
```